from workflow.parse_mode import ParseSites
from workflow.quote_generation import QuoteGeneration
from UI.main_ui import *

"""
██████╗░██╗░░░██╗░░███╗░░██╗░░░░░██╗░░██╗██████╗░░█████╗░████████╗░█████╗░░█████╗░░█████╗░
╚════██╗██║░░░██║░████║░░██║░░░░░██║░██╔╝██╔══██╗██╔══██╗╚══██╔══╝██╔═══╝░██╔═══╝░██╔═══╝░
░█████╔╝╚██╗░██╔╝██╔██║░░██║░░░░░█████═╝░██████╔╝██║░░██║░░░██║░░░██████╗░██████╗░██████╗░
░╚═══██╗░╚████╔╝░╚═╝██║░░██║░░░░░██╔═██╗░██╔══██╗██║░░██║░░░██║░░░██╔══██╗██╔══██╗██╔══██╗
██████╔╝░░╚██╔╝░░███████╗███████╗██║░╚██╗██║░░██║╚█████╔╝░░░██║░░░╚█████╔╝╚█████╔╝╚█████╔╝
╚═════╝░░░░╚═╝░░░╚══════╝╚══════╝╚═╝░░╚═╝╚═╝░░╚═╝░╚════╝░░░░╚═╝░░░░╚════╝░░╚════╝░░╚════╝░

Генератор цитат из фильмов с игрфическим интерфейсом

v.0.0.2(add GUI)

Сайт с цитатами: https://citaty.info/

"""
def main():
    app = QApplication(sys.argv)
    window = UserInterface()
    window.show()
    sys.exit(app.exec_())


if __name__ == "__main__":
    main()